In [19]:
import jmespath
import pandas as pd

In [36]:
data = [
    {
      "name": "iPhone",
      "price": 999,
      "visa": [
          {
              "class": "A1",
              "number": 1234
          },
          {
              "class": "A2",
              "number": 1134
          }
      ]
    },
    {
      "name": "Samsung Galaxy",
      "price": 899,
              "visa": [
          {
              "class": "A1",
              "number": 1234
          },
          {
              "class": "B2",
              "number": 1134
          }
      ]
    },
    {
      "name": "Google Pixel",
      "price": 799,
              "visa": [
          {
              "class": "B1",
              "number": 1234
          },
          {
              "class": "B1/B2",
              "number": 1134
          }
      ]
    },
    {
      "name": "OnePlus",
      "price": 699,
              "visa": [
          {
              "class": "X4",
              "number": 1234
          }
      ]
    }
  ]

In [38]:
print(jmespath.search('length(@)', data))

4

In [39]:
print(jmespath.search('[].{name: name, price:price}', data))

[{'name': 'iPhone', 'price': 999}, {'name': 'Samsung Galaxy', 'price': 899}, {'name': 'Google Pixel', 'price': 799}, {'name': 'OnePlus', 'price': 699}]

In [40]:
list1 = jmespath.search('[].{name: name, price:price}', data)

In [41]:
df = pd.DataFrame.from_dict(list1)

In [42]:
df

             name  price
0          iPhone    999
1  Samsung Galaxy    899
2    Google Pixel    799
3         OnePlus    699

In [43]:
print(jmespath.search('[].visa.length(@)', data))

[2, 2, 2, 1]

In [44]:
list2 = jmespath.search('[].{name: name, price:price, visa:visa}', data)

In [45]:
df = pd.DataFrame.from_dict(list2)
df

             name  price                                               visa
0          iPhone    999  [{'class': 'A1', 'number': 1234}, {'class': 'A...
1  Samsung Galaxy    899  [{'class': 'A1', 'number': 1234}, {'class': 'B...
2    Google Pixel    799  [{'class': 'B1', 'number': 1234}, {'class': 'B...
3         OnePlus    699                  [{'class': 'X4', 'number': 1234}]

In [59]:
df2 = pd.json_normalize(data, 'visa', ['price', 'name'])
df2

   class  number price            name
0     A1    1234   999          iPhone
1     A2    1134   999          iPhone
2     A1    1234   899  Samsung Galaxy
3     B2    1134   899  Samsung Galaxy
4     B1    1234   799    Google Pixel
5  B1/B2    1134   799    Google Pixel
6     X4    1234   699         OnePlus

In [63]:
# https://pandas.pydata.org/pandas-docs/version/0.24.2/reference/api/pandas.io.json.json_normalize.html
family = [
  {
    'id': 1,
    'name': {
      'first': 'Coleen',
      'last': 'Volk'
    }
  },
  {
    'name': {
      'given': 'Mose',
      'family': 'Regner'
    }
  },
  {
    'id': 2,
    'name': 'Faye Raker'
  }
]

In [64]:
df = pd.json_normalize(family)
df

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mose      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker